export const PatternsTypes = [
  {
    name: 'Порождающие',
    description: 'Отвечают за удобное и безопасное создание новых объектов или даже целых семейств объектов.',
    type: 'creational',
  },
  {
    name: 'Структурные',
    description: 'Отвечают за построение удобных в поддержке иерархий классов.',
    type: 'structural',
  },
  {
    name: 'Поведенческие',
    description: 'Решают задачи эффективного и безопасного взаимодействия между объектами программы.',
    type: 'behavioral',
  },
];


